### Libraries

In [1]:
import os
tilde = os.path.expanduser('~')

import sys
sys.path.insert(0, tilde + '/Scripts/Fake Folder Copy/Python Libraries')

from jb_libraries import *
%matplotlib inline

### Script settings

In [24]:
close_workbook = 'no'

#report_type = 'year and month'
report_type = 'year and quarter'
#report_type = 'other'

title = '2018 - Q4 - Gross Sales Report.xlsx'

date_start = '2018-10-01'
date_end = '2018-12-31'

one_year_ago = str(pd.to_datetime(date_end) - pd.DateOffset(years = 1))[:7] + '-01'

pretty_date = jb_dates(pd.Series(date_start), report_type + ' pretty')[0]

csv_path = tilde + '/Scripts/Fake Folder Copy/Finance/Recurring/Gross Sales Report/CSVs/'

### Get data

In [3]:
status_exclude = [8,9,10,11,12,14,15]

ot_super_main = pd.read_sql(
'''
SELECT
DATE(date_purchased) AS date_purchased,
DATE_FORMAT(date_purchased, '%Y-%m') AS year_and_month,
ot.*
FROM orders_total ot
JOIN orders o ON ot.orders_id = o.orders_id
AND orders_status NOT IN '''+ str(tuple(status_exclude)) +'''
AND payment_method != 'Replacement Order'
AND DATE(o.date_purchased) BETWEEN ' '''+ date_start +''' ' AND ' '''+ date_end +''' '
''', db)

col_fix(ot_super_main)

ot_super_main['date purchased'] = pd.to_datetime(ot_super_main['date purchased'])
ot_super_main['year and quarter'] = ot_super_main['date purchased'].map(str).str[:4] + '-Q' + ot_super_main['date purchased'].dt.quarter.map(str)

ot_super_main['class'] = ot_super_main['class'].str.replace('ot_','').str.replace('_',' ')

### By OID

In [4]:
ot_main = ot_super_main.groupby(['orders id','class'])[['value']].sum().unstack().fillna(0)
ot_main.columns = ot_main.columns.droplevel(0)

ls = ['coupon','deduction','gv','refund']
for col in ls:
    try:
        ot_main[col] = ot_main[col] * -1
    except:
        pass

ls = []
for col in ot_main.columns:
    if ot_main[col].dtypes == 'float64':
        ls.append(col)
ls.remove('total')  
        
a = ot_main[np.abs(ot_main[ls].sum(1) - ot_main['total']) > 0.01].copy()

if a.empty:
    pass
else:
    # sometimes CSP recalculates order totals and things get weird
    print('you have mismatching sums and totals\nthese are fixed in the next section, and are displayed below')
    a['diff'] = a['total'] - (a.sum(1) - a['total'])
    display(a)

ot_main.reset_index(inplace = True)
for col in ['date purchased','year and month','year and quarter']:
    ot_main[col] = ot_main['orders id'].map(dict(zip(ot_super_main['orders id'], ot_super_main[col])))
    
ls = []
for col in ot_main.columns:
    if ot_main[col].dtypes != 'O':
        if (ot_main[col] == 0).all():
            ls.append(col)
            
ot_main.drop(ls, 1, inplace = True)

you have mismatching sums and totals
these are fixed in the next section, and are displayed below

class,,check fee,coupon,ddp,deduction,gv,refund,shipping,subtotal,tax,total,wiretransfer fee,diff
orders id,,,,,,,,,,,,,
1867862,0.0,0.0,-0.00,0.00,-0.0,-0.00,-0.0,0.00,60.00,0.0,0.00,0.0,-60.00
1880734,0.0,0.0,-0.00,11.47,-0.0,-0.00,-0.0,24.85,185.65,0.0,210.50,0.0,-11.47
1929230,0.0,0.0,-0.00,0.00,-0.0,-4.14,-0.0,0.00,2474.29,0.0,2474.29,0.0,4.14
1936119,0.0,0.0,-16.49,0.00,-0.0,-0.00,-0.0,16.27,164.85,7.1,168.18,0.0,-3.55

### Factor in CSP manual adjustments
So that the sum of the parts actually equals the total

In [5]:
ls = list(set(ot_super_main['class']))
for x in ['total','']:
    ls.remove(x)

t1 = ot_main[ls].sum(1)
t2 = ot_main['total']

adj = list(t2 - t1)
adj = np.around(adj,2)

ot_main['manual adjustment'] = adj

### Reorder columns

In [6]:
cols = ot_main.columns.tolist()
ls = ['orders id','subtotal','tax','manual adjustment','total','date purchased','year and month','year and quarter']
for x in ls:
    cols.remove(x)
new_cols = [ls[0]] + ls[-3:] + cols + ls[1:-3]

s1 = set(new_cols)
s2 = set(ot_main.columns.tolist())
s3 = s1.symmetric_difference(s2)

if len(s3) > 0:
    raise ValueError('you missed some columns')    
    
ot_main = ot_main[new_cols]

### Get Daily Stats data

In [7]:
ds = pd.read_sql(
'''
SELECT
DATE(timestamp) AS date_purchased,
SUM(d_value) AS ds_rev
FROM daily_stats
WHERE DATE(timestamp) BETWEEN ' '''+ date_start +''' ' AND ' '''+ date_end +''' '
AND d_class = 'd_all'
GROUP BY date_purchased
''', db)

col_fix(ds)

ds['date purchased'] = pd.to_datetime(ds['date purchased'])
for col in ['year and month','year and quarter']:
    ds[col] = jb_dates(ds['date purchased'], col)

### Compare Orders Totals with Daily Stats
Differences are ok, as long as they are not huge, just check them out here.

In [21]:
a = ot_main.groupby('date purchased', as_index = False)[['subtotal']].sum()
a.rename(columns = {'subtotal':'ot rev'}, inplace = True)

b = pd.merge(a, ds.drop(['year and month','year and quarter'],1), on = 'date purchased')

c = b[np.abs(b['ot rev'] - b['ds rev']) > 1].copy()
c['diff'] = c['ot rev'] - c['ds rev']

print('total mismatch: ${:,.0f}'.format(c['diff'].sum()))
fmt = [0,'m0','m0','m0']
c.format_(fmt).tail(13)

total mismatch: $0

Empty DataFrame
Columns: [Date Purchased, Ot Rev, Ds Rev, Diff]
Index: []

### Get orders_products data

In [22]:
op = pd.read_sql(
'''
SELECT
DATE(date_purchased) AS date_purchased,
op.orders_id,
SUM((products_quantity - products_quantity_free) * products_price) AS op_rev
FROM orders_products op
JOIN orders o ON op.orders_id = o.orders_id
AND orders_status NOT IN '''+ str(tuple(status_exclude)) +'''
AND payment_method != 'Replacement Order'
AND DATE(o.date_purchased) BETWEEN ' '''+ date_start +''' ' AND ' '''+ date_end +''' '
GROUP BY op.orders_id
''', db)

col_fix(op)

op['date purchased'] = pd.to_datetime(op['date purchased'])
op['ot rev'] = op['orders id'].map(dict(zip(ot_main['orders id'], ot_main['subtotal'])))

### Compare Orders Products with Orders Totals
Differences are ok, as long as they are not huge, just check them out here.

In [23]:
dates = c['date purchased'].tolist()

d = op[(op['date purchased'].isin(dates)) & (np.abs(op['op rev'] - op['ot rev']) > 0.01)].copy()
d['diff'] = d['ot rev'] - d['op rev']

print('total mismatch: ${:,.0f}'.format(d['diff'].sum()))
fmt = [0,0,'m2','m2','m2']
d.format_(fmt)

total mismatch: $0

Empty DataFrame
Columns: [Date Purchased, Orders Id, Op Rev, Ot Rev, Diff]
Index: []

### Current month difference

In [11]:
a = ot_main['subtotal'].sum()
b = ds['ds rev'].sum()

print('Daily Stats says ${:,.0f}, which is a difference of\nGross Sales - Daily Stats\n= ${:,.0f} - ${:,.0f}\n= ${:,.0f}'.format(b,a,b,a-b))

Daily Stats says $11,219,379, which is a difference of
Gross Sales - Daily Stats
= $11,219,379 - $11,219,379
= $-0

### Comparison for Dev

In [12]:
pd.read_sql(
'''
SELECT
*
FROM orders_status
WHERE orders_status_id IN (8, 9, 10, 11, 12, 14, 15)
ORDER BY orders_status_id
''', db)

   orders_status_id  language_id  orders_status_name
0                 8            1     Fraud - Pending
1                 9            1   Fraud - Confirmed
2                10            1              Return
3                11            1  Replaced Defective
4                12            1  Refunded Defective
5                14            1              Voided
6                15            1        Fraud - Void

In [13]:
pd.read_sql(
'''
SELECT 
A.year_and_month,
CONCAT('$', FORMAT(A.ot_subtotal,2)) AS ot_subtotal,
CONCAT('$', FORMAT(B.op_subtotal, 2)) AS op_subtotal,
CONCAT('$', FORMAT(C.ds_subtotal, 2)) AS ds_subtotal,

CONCAT('$', FORMAT(A.ot_subtotal - B.op_subtotal, 2)) AS ot_and_op_diff,
CONCAT('$', FORMAT(A.ot_subtotal - C.ds_subtotal, 2)) AS ot_and_ds_diff,
CONCAT('$', FORMAT(B.op_subtotal - C.ds_subtotal, 2)) AS op_and_ds_diff

FROM

# orders_total
(SELECT
DATE_FORMAT(date_purchased, '%Y-%m') AS year_and_month,
SUM(value) AS ot_subtotal
FROM orders_total ot
JOIN orders o ON ot.orders_id = o.orders_id
AND DATE(date_purchased) BETWEEN ' '''+ one_year_ago +''' ' AND ' '''+ date_end +''' '
AND orders_status NOT IN (8, 9, 10, 11, 12, 14, 15)
AND payment_method != 'Replacement Order'
WHERE class = 'ot_subtotal'
GROUP BY year_and_month) A

JOIN

# orders_products
(SELECT
DATE_FORMAT(date_purchased, '%Y-%m') AS year_and_month,
SUM((products_quantity - products_quantity_free) * products_price) AS op_subtotal
FROM orders_products op
JOIN orders o ON op.orders_id = o.orders_id
AND DATE(date_purchased) BETWEEN ' '''+ one_year_ago +''' ' AND ' '''+ date_end +''' '
AND orders_status NOT IN (8, 9, 10, 11, 12, 14, 15)
AND payment_method != 'Replacement Order'
GROUP BY year_and_month) B ON A.year_and_month = B.year_and_month

JOIN

# daily stats
(SELECT
DATE_FORMAT(timestamp, '%Y-%m') AS year_and_month,
SUM(d_value) AS ds_subtotal
FROM daily_stats
WHERE DATE(timestamp) BETWEEN ' '''+ one_year_ago +''' ' AND ' '''+ date_end +''' '
AND d_class = 'd_all'
GROUP BY year_and_month) C ON A.year_and_month = C.year_and_month
''', db)

,year_and_month,ot_subtotal,op_subtotal,ds_subtotal,ot_and_op_diff,ot_and_ds_diff,op_and_ds_diff
0,2017-12,"$3,929,415.50","$3,926,968.69","$3,929,415.47","$2,446.81",$0.03,"$-2,446.78"
1,2018-01,"$3,539,519.81","$3,538,819.03","$3,539,519.82",$700.78,$-0.01,$-700.79
2,2018-02,"$3,312,539.03","$3,309,758.30","$3,312,539.03","$2,780.73",$-0.00,"$-2,780.73"
3,2018-03,"$4,369,445.90","$4,366,098.78","$4,369,445.96","$3,347.12",$-0.06,"$-3,347.18"
4,2018-04,"$3,705,274.81","$3,703,419.97","$3,705,274.77","$1,854.84",$0.04,"$-1,854.80"
5,2018-05,"$3,933,957.74","$3,933,196.30","$3,933,957.76",$761.44,$-0.02,$-761.46
6,2018-06,"$3,272,854.06","$3,272,136.85","$3,272,854.05",$717.21,$0.01,$-717.20
7,2018-07,"$3,448,739.19","$3,448,093.57","$3,448,739.16",$645.62,$0.03,$-645.59
8,2018-08,"$3,141,870.70","$3,141,453.12","$3,141,870.70",$417.58,$-0.00,$-417.58
9,2018-09,"$3,081,420.20","$3,079,352.05","$3,081,420.21","$2,068.15",$-0.01,"$-2,068.16"
10,2018-10,"$4,167,302.92","$4,166,938.95","$4,167,302.94",$363.97,$-0.02,$-363.99
11,2018-11,"$3,887,229.89","$3,886,675.57","$3,887,229.88",$554.32,$0.01,$-554.31
12,2018-12,"$3,164,845.98","$3,163,093.14","$3,164,846.00","$1,752.84",$-0.02,"$-1,752.86"

### From Daigo
In email "Matching Products Report Values to PLM Stats"

In [14]:
pd.read_sql(
'''
SELECT
A.orders_id,
A.op_value,
A.ot_value,
A.op_value - A.ot_value AS diff

FROM

(SELECT
o.orders_id,
CAST(SUM((op.products_quantity - op.products_quantity_free) * op.products_price) AS DEC(10,2)) AS op_value,
ot.value AS ot_value
FROM orders o 
LEFT JOIN orders_products op ON o.orders_id = op.orders_id
LEFT JOIN orders_total ot On ot.class = 'ot_subtotal' AND o.orders_id = ot.orders_id
WHERE DATE(o.date_purchased) BETWEEN ' '''+ one_year_ago +''' ' AND ' '''+ date_end +''' '
GROUP BY o.orders_id
HAVING ot.value != CAST(SUM((op.products_quantity - op.products_quantity_free) * op.products_price) AS DEC(10,2))
ORDER BY o.orders_id DESC
LIMIT 5) A
''', db)

   orders_id  op_value  ot_value   diff
0    1939942    372.91    387.27 -14.36
1    1938778     33.30     34.05  -0.75
2    1932252    190.84    196.40  -5.56
3    1932234     38.75     45.70  -6.95
4    1931964   2334.20   2338.22  -4.02

### Sales by class

In [15]:
ls = []
for col in ot_main.columns:
    if ot_main[col].dtypes == 'float64':
        ls.append(col)
        
by_class = pd.DataFrame(ot_main[ls].sum()).T
by_class[report_type] = pretty_date

cols = by_class.columns.tolist()
for x in ['subtotal','tax','manual adjustment','total',report_type]:
    cols.remove(x)
cols = [report_type] + cols + ['subtotal','manual adjustment','tax','total']

by_class = by_class[cols]

a = (by_class.drop(report_type,1).sum(1) - by_class['total']).values[0]
b = (by_class['total']).values[0]

if np.abs(a-b) > 1:
    raise 0

In [16]:
fmt = [0] + ['m0'] * 12
by_class.format_(fmt)

,Year And Quarter,Check Fee,Coupon,Ddp,Deduction,Gv,Refund,Shipping,Wiretransfer Fee,Subtotal,Manual Adjustment,Tax,Total
0,Q4 2018,$846,"$-128,409","$66,850",$-297,"$-21,401",$-391,"$767,515","$1,175","$11,219,379",$-71,"$176,790","$12,081,985"

### Write to excel

In [17]:
if close_workbook == 'yes':
    workbook = xlsxwriter.Workbook(csv_path + title,
                                   {'nan_inf_to_errors': True})

    tabs = ['By OID','By Class']

    ls = []
    for col in ot_main.columns:
        if ot_main[col].dtypes == 'float64':
            ls.append(col)

    col_names = workbook.add_format({'font_name':'Arial (Bold)',
                                     'font_color':'black',
                                     'valign':'vcenter',
                                     'align':'center',
                                     'bottom':1,
                                     'top':1,
                                     'left':1,
                                     'right':1})

    money = workbook.add_format({'num_format':'$#,##0.0'})
    date = workbook.add_format({'num_format':'yyyy-mm-dd'})
    dummy = workbook.add_format({'num_format':''})

    for tab in tabs:
        workbook.add_worksheet(tab) # create each tab

    my_worksheets = {}
    for sht in workbook.worksheets():
        my_worksheets[sht.get_name()] = sht # create dict like tab_name:worksheet_instance

    sht = my_worksheets['By OID']

    df = ot_main

    start_row = 0
    start_col = 0
    for i in range(len(df.columns)):
        sht.write(start_row, start_col + i,
                  df.columns[i].title(),
                  col_names)
        
        len1 = [len(str(x)) for x in df.iloc[:, i]]
        len2 = [len(df.columns[i])]
        len3 = np.max(len1 + len2)
        
        sht.set_column(start_col + i,
                       start_col + i,
                       len3)        

        c = df.columns[i]
        if df[c].dtypes == 'float64':
            fmt = money
        elif df[c].dtypes == '<M8[ns]':
            fmt = date
        else:
            fmt = dummy
        for j in range(len(df)):
            sht.write(start_row + 1 + j, start_col + i,
                     df.iloc[j,i],
                     fmt)

    sht = my_worksheets['By Class']
    
    if report_type == 'year and month':
        df = by_class
        
    elif report_type == 'year and quarter':
        df = ot_main.groupby(['year and month']).sum().drop('orders id',1)
        df.index = jb_dates(pd.Series(df.index), 'year and month pretty')
        df.loc[pretty_date + ' total'] = df.sum()
        df.reset_index(inplace = True)
        df.rename(columns = {'index':''}, inplace = True)
        
    start_row = 0
    start_col = 0
    
    for i in range(len(df.columns)):
        sht.write(start_row, start_col + i,
                  df.columns[i].title(),
                  col_names)
        
        len1 = [len(str(x)) for x in df.iloc[:, i]]
        len2 = [len(df.columns[i])]
        len3 = np.max(len1 + len2)
        
        sht.set_column(start_col + i,
                       start_col + i,
                       len3)        

        c = df.columns[i]
        if df[c].dtypes == 'float64':
            fmt = money
        elif df[c].dtypes == '<M8[ns]':
            fmt = date
        else:
            fmt = dummy
        for j in range(len(df)):
            sht.write(start_row + 1 + j, start_col + i,
                     df.iloc[j,i],
                     fmt)


    workbook.close()

In [18]:
print('done')

done